## us-east-1 plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.default_vpc.aws_default_vpc.this[0] will be created
+   resource "aws_default_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = (known after apply)
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = false
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       existing_default_vpc                 = (known after apply)
+       force_destroy                        = false
+       id                                   = (known after apply)
+       instance_tenancy                     = (known after apply)
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = (known after apply)
+       tags_all                             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```